In [24]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

pd.set_option('display.min_rows', 10)
pd.set_option('display.max_rows', 10)

In [25]:
# hide
df = pd.read_csv('./tidy-data/baby-names-by-state.csv')

In [26]:
df

       state  year     name  number   sex
0         AK  1960    David   151.0   boy
1         AK  1960  Michael   139.0   boy
2         AK  1960   Robert   135.0   boy
3         AK  1960     John   126.0   boy
4         AK  1960    James   123.0   boy
...      ...   ...      ...     ...   ...
502613    WY  2008  Madelyn     6.0  girl
502614    WY  2008   Marlee     6.0  girl
502615    WY  2008     Mary     6.0  girl
502616    WY  2008     Maya     6.0  girl
502617    WY  2008      Mya     6.0  girl

[502618 rows x 5 columns]

In [27]:
df.sort_values(by=['state', 'year', 'sex', 'number'], 
               ascending=[True, True, True, False],
               inplace=True)
df.drop_duplicates(subset=['state', 'year', 'sex'], inplace=True)
df

       state  year     name  number   sex
0         AK  1960    David   151.0   boy
251309    AK  1960     Mary    78.0  girl
113       AK  1961    David   145.0   boy
251422    AK  1961     Mary    80.0  girl
220       AK  1962     John   156.0   boy
...      ...   ...      ...     ...   ...
502278    WY  2006    Emily    39.0  girl
251077    WY  2007    Ethan    37.0   boy
502386    WY  2007  Madison    36.0  girl
251189    WY  2008    James    41.0   boy
502498    WY  2008  Madison    35.0  girl

[4900 rows x 5 columns]

In [38]:
# Save baby names to file.
grouped = df.groupby('year')

for year,df_group in grouped:
    filename = './tidy-data/test_files/baby-names-by-state-{}.csv'.format(year)
    df_group.to_csv(filename)

In [34]:
'./tidy-data/baby-names-by-state-{}_test_file.csv'.format(1966)

'./tidy-data/baby-names-by-state-1966.csv'